<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Country;

class CountrySeeder extends Seeder
{
    public function run(): void
    {
        $countries = [
            [
                'title' => 'กรีซ',
                'code' => '300'
            ],
            [
                'title' => 'กรีนแลนด์',
                'code' => '304'
            ],
            [
                'title' => 'กวม',
                'code' => '316'
            ],
            [
                'title' => 'กัมพูชา',
                'code' => '116'
            ],
            [
                'title' => 'กัวเดอลุป',
                'code' => '312'
            ],
            [
                'title' => 'กัวเตมาลา',
                'code' => '320'
            ],
            [
                'title' => 'กาตาร์',
                'code' => '634'
            ],
            [
                'title' => 'กานา',
                'code' => '288'
            ],
            [
                'title' => 'กาบอง',
                'code' => '266'
            ],
            [
                'title' => 'กาบูเวร์ดี',
                'code' => '132'
            ],
            [
                'title' => 'กายอานา',
                'code' => '328'
            ],
            [
                'title' => 'กินี',
                'code' => '324'
            ],
            [
                'title' => 'กินี-บิสเซา',
                'code' => '624'
            ],
            [
                'title' => 'กือราเซา',
                'code' => '531'
            ],
            [
                'title' => 'เกรเนดา',
                'code' => '308'
            ],
            [
                'title' => 'เกาหลีใต้',
                'code' => '410'
            ],
            [
                'title' => 'เกาหลีเหนือ',
                'code' => '408'
            ],
            [
                'title' => 'เกาะคริสต์มาส',
                'code' => '162'
            ],
            [
                'title' => 'เกาะเซาท์จอร์เจียและหมู่เกาะเซาท์แซนด์วิช',
                'code' => '239'
            ],
            [
                'title' => 'เกาะนอร์ฟอล์ก',
                'code' => '574'
            ],
            [
                'title' => 'เกาะบูเวต์',
                'code' => '74'
            ],
            [
                'title' => 'เกาะเล็กรอบนอกของสหรัฐอเมริกา',
                'code' => '581'
            ],
            [
                'title' => 'เกาะเฮิร์ดและหมู่เกาะแมกดอนัลด์',
                'code' => '334'
            ],
            [
                'title' => 'เกิร์นซีย์',
                'code' => '831'
            ],
            [
                'title' => 'แกมเบีย',
                'code' => '270'
            ],
            [
                'title' => 'โกตดิวัวร์',
                'code' => '384'
            ],
            [
                'title' => 'คอโมโรส',
                'code' => '174'
            ],
            [
                'title' => 'คอสตาริกา',
                'code' => '188'
            ],
            [
                'title' => 'คาซัคสถาน',
                'code' => '398'
            ],
            [
                'title' => 'คิริบาส',
                'code' => '296'
            ],
            [
                'title' => 'คิวบา',
                'code' => '192'
            ],
            [
                'title' => 'คีร์กีซสถาน',
                'code' => '417'
            ],
            [
                'title' => 'คูเวต',
                'code' => '414'
            ],
            [
                'title' => 'เคนยา',
                'code' => '404'
            ],
            [
                'title' => 'แคนาดา',
                'code' => '124'
            ],
            [
                'title' => 'แคเมอรูน',
                'code' => '120'
            ],
            [
                'title' => 'โครเอเชีย',
                'code' => '191'
            ],
            [
                'title' => 'โคลอมเบีย',
                'code' => '170'
            ],
            [
                'title' => 'จอร์เจีย',
                'code' => '268'
            ],
            [
                'title' => 'จอร์แดน',
                'code' => '400'
            ],
            [
                'title' => 'จาเมกา',
                'code' => '388'
            ],
            [
                'title' => 'จิบูตี',
                'code' => '262'
            ],
            [
                'title' => 'จีน',
                'code' => '156'
            ],
            [
                'title' => 'เจอร์ซีย์',
                'code' => '832'
            ],
            [
                'title' => 'ชาด',
                'code' => '148'
            ],
            [
                'title' => 'ชิลี',
                'code' => '152'
            ],
            [
                'title' => 'เช็กเกีย',
                'code' => '203'
            ],
            [
                'title' => 'ซานมารีโน',
                'code' => '674'
            ],
            [
                'title' => 'ซามัว',
                'code' => '882'
            ],
            [
                'title' => 'ซาอุดีอาระเบีย',
                'code' => '682'
            ],
            [
                'title' => 'ซาฮาราตะวันตก',
                'code' => '732'
            ],
            [
                'title' => 'ซิมบับเว',
                'code' => '716'
            ],
            [
                'title' => 'ซีเรีย',
                'code' => '760'
            ],
            [
                'title' => 'ซูดาน',
                'code' => '736'
            ],
            [
                'title' => 'ซูรินาม',
                'code' => '740'
            ],
            [
                'title' => 'เซเชลส์',
                'code' => '690'
            ],
            [
                'title' => 'เซนต์คิตส์และเนวิส',
                'code' => '659'
            ],
            [
                'title' => 'เซนต์ลูเชีย',
                'code' => '662'
            ],
            [
                'title' => 'เซนต์วินเซนต์และเกรนาดีนส์',
                'code' => '670'
            ],
            [
                'title' => 'เซนต์เฮเลนา',
                'code' => '654'
            ],
            [
                'title' => 'เซเนกัล',
                'code' => '686'
            ],
            [
                'title' => 'เซอร์เบีย',
                'code' => '688'
            ],
            [
                'title' => 'เซาตูเมและปรินซีปี',
                'code' => '678'
            ],
            [
                'title' => 'เซียร์ราลีโอน',
                'code' => '694'
            ],
            [
                'title' => 'แซงบาร์เตเลมี',
                'code' => '652'
            ],
            [
                'title' => 'แซงปีแยร์และมีเกอลง',
                'code' => '666'
            ],
            [
                'title' => 'แซงมาร์แตง',
                'code' => '663'
            ],
            [
                'title' => 'แซมเบีย',
                'code' => '894'
            ],
            [
                'title' => 'โซมาเลีย',
                'code' => '706'
            ],
            [
                'title' => 'ไซปรัส',
                'code' => '196'
            ],
            [
                'title' => 'ญี่ปุ่น',
                'code' => '392'
            ],
            [
                'title' => 'ดอมินีกา',
                'code' => '212'
            ],
            [
                'title' => 'เดนมาร์ก',
                'code' => '208'
            ],
            [
                'title' => 'ตรินิแดดและโตเบโก',
                'code' => '780'
            ],
            [
                'title' => 'ตองงา',
                'code' => '776'
            ],
            [
                'title' => 'ติมอร์-เลสเต',
                'code' => '626'
            ],
            [
                'title' => 'ตุรกี',
                'code' => '792'
            ],
            [
                'title' => 'ตูนิเซีย',
                'code' => '788'
            ],
            [
                'title' => 'ตูวาลู',
                'code' => '798'
            ],
            [
                'title' => 'เติร์กเมนิสถาน',
                'code' => '795'
            ],
            [
                'title' => 'โตโก',
                'code' => '768'
            ],
            [
                'title' => 'ไต้หวัน',
                'code' => '158'
            ],
            [
                'title' => 'ทาจิกิสถาน',
                'code' => '762'
            ],
            [
                'title' => 'แทนซาเนีย',
                'code' => '834'
            ],
            [
                'title' => 'โทเคอเลา',
                'code' => '772'
            ],
            [
                'title' => 'ไทย',
                'code' => '764'
            ],
            [
                'title' => 'นครรัฐวาติกัน',
                'code' => '336'
            ],
            [
                'title' => 'นอร์เวย์',
                'code' => '578'
            ],
            [
                'title' => 'นามิเบีย',
                'code' => '516'
            ],
            [
                'title' => 'นาอูรู',
                'code' => '520'
            ],
            [
                'title' => 'นิการากัว',
                'code' => '558'
            ],
            [
                'title' => 'นิวแคลิโดเนีย',
                'code' => '540'
            ],
            [
                'title' => 'นิวซีแลนด์',
                'code' => '554'
            ],
            [
                'title' => 'นีวเว',
                'code' => '570'
            ],
            [
                'title' => 'เนเธอร์แลนด์',
                'code' => '528'
            ],
            [
                'title' => 'เนปาล',
                'code' => '524'
            ],
            [
                'title' => 'ไนจีเรีย',
                'code' => '566'
            ],
            [
                'title' => 'ไนเจอร์',
                'code' => '562'
            ],
            [
                'title' => 'บราซิล',
                'code' => '76'
            ],
            [
                'title' => 'บริติชอินเดียนโอเชียนเทร์ริทอรี',
                'code' => '86'
            ],
            [
                'title' => 'บรูไน',
                'code' => '96'
            ],
            [
                'title' => 'บอตสวานา',
                'code' => '72'
            ],
            [
                'title' => 'บอสเนียและเฮอร์เซโกวีนา',
                'code' => '70'
            ],
            [
                'title' => 'บังกลาเทศ',
                'code' => '50'
            ],
            [
                'title' => 'บัลแกเรีย',
                'code' => '100'
            ],
            [
                'title' => 'บาร์เบโดส',
                'code' => '52'
            ],
            [
                'title' => 'บาห์เรน',
                'code' => '48'
            ],
            [
                'title' => 'บาฮามาส',
                'code' => '44'
            ],
            [
                'title' => 'บุรุนดี',
                'code' => '108'
            ],
            [
                'title' => 'บูร์กินาฟาโซ',
                'code' => '854'
            ],
            [
                'title' => 'เบนิน',
                'code' => '204'
            ],
            [
                'title' => 'เบลเยียม',
                'code' => '56'
            ],
            [
                'title' => 'เบลารุส',
                'code' => '112'
            ],
            [
                'title' => 'เบลีซ',
                'code' => '84'
            ],
            [
                'title' => 'เบอร์มิวดา',
                'code' => '60'
            ],
            [
                'title' => 'โบลิเวีย',
                'code' => '68'
            ],
            [
                'title' => 'ปวยร์โตรีโก',
                'code' => '630'
            ],
            [
                'title' => 'ปากีสถาน',
                'code' => '586'
            ],
            [
                'title' => 'ปานามา',
                'code' => '591'
            ],
            [
                'title' => 'ปาปัวนิวกินี',
                'code' => '598'
            ],
            [
                'title' => 'ปารากวัย',
                'code' => '600'
            ],
            [
                'title' => 'ปาเลสไตน์',
                'code' => '275'
            ],
            [
                'title' => 'ปาเลา',
                'code' => '585'
            ],
            [
                'title' => 'เปรู',
                'code' => '604'
            ],
            [
                'title' => 'โปรตุเกส',
                'code' => '620'
            ],
            [
                'title' => 'โปแลนด์',
                'code' => '616'
            ],
            [
                'title' => 'ฝรั่งเศส',
                'code' => '250'
            ],
            [
                'title' => 'พม่า',
                'code' => '104'
            ],
            [
                'title' => 'ฟินแลนด์',
                'code' => '246'
            ],
            [
                'title' => 'ฟิลิปปินส์',
                'code' => '608'
            ],
            [
                'title' => 'ฟีจี',
                'code' => '242'
            ],
            [
                'title' => 'เฟรนช์เกียนา',
                'code' => '254'
            ],
            [
                'title' => 'เฟรนช์เซาเทิร์นและแอนตาร์กติกแลนดส์',
                'code' => '260'
            ],
            [
                'title' => 'เฟรนช์พอลินีเชีย',
                'code' => '258'
            ],
            [
                'title' => 'ภูฏาน',
                'code' => '64'
            ],
            [
                'title' => 'มองโกเลีย',
                'code' => '496'
            ],
            [
                'title' => 'มอนต์เซอร์รัต',
                'code' => '500'
            ],
            [
                'title' => 'มอนเตเนโกร',
                'code' => '499'
            ],
            [
                'title' => 'มอริเชียส',
                'code' => '480'
            ],
            [
                'title' => 'มอริเตเนีย',
                'code' => '478'
            ],
            [
                'title' => 'มอลโดวา',
                'code' => '498'
            ],
            [
                'title' => 'มอลตา',
                'code' => '470'
            ],
            [
                'title' => 'มัลดีฟส์',
                'code' => '462'
            ],
            [
                'title' => 'มาเก๊า',
                'code' => '446'
            ],
            [
                'title' => 'นอร์ทมาซิโดเนีย',
                'code' => '807'
            ],
            [
                'title' => 'มาดากัสการ์',
                'code' => '450'
            ],
            [
                'title' => 'มายอต',
                'code' => '175'
            ],
            [
                'title' => 'มาร์ตีนิก',
                'code' => '474'
            ],
            [
                'title' => 'มาลาวี',
                'code' => '454'
            ],
            [
                'title' => 'มาลี',
                'code' => '466'
            ],
            [
                'title' => 'มาเลเซีย',
                'code' => '458'
            ],
            [
                'title' => 'เม็กซิโก',
                'code' => '484'
            ],
            [
                'title' => 'โมซัมบิก',
                'code' => '508'
            ],
            [
                'title' => 'โมนาโก',
                'code' => '492'
            ],
            [
                'title' => 'โมร็อกโก',
                'code' => '504'
            ],
            [
                'title' => 'ไมโครนีเซีย',
                'code' => '583'
            ],
            [
                'title' => 'ยิบรอลตาร์',
                'code' => '292'
            ],
            [
                'title' => 'ยูกันดา',
                'code' => '800'
            ],
            [
                'title' => 'ยูเครน',
                'code' => '804'
            ],
            [
                'title' => 'เยเมน',
                'code' => '887'
            ],
            [
                'title' => 'เยอรมนี',
                'code' => '276'
            ],
            [
                'title' => 'รวันดา',
                'code' => '646'
            ],
            [
                'title' => 'รัสเซีย',
                'code' => '643'
            ],
            [
                'title' => 'เรอูว์นียง',
                'code' => '638'
            ],
            [
                'title' => 'โรมาเนีย',
                'code' => '642'
            ],
            [
                'title' => 'ลักเซมเบิร์ก',
                'code' => '442'
            ],
            [
                'title' => 'ลัตเวีย',
                'code' => '428'
            ],
            [
                'title' => 'ลาว',
                'code' => '418'
            ],
            [
                'title' => 'ลิกเตนสไตน์',
                'code' => '438'
            ],
            [
                'title' => 'ลิทัวเนีย',
                'code' => '440'
            ],
            [
                'title' => 'ลิเบีย',
                'code' => '434'
            ],
            [
                'title' => 'เลโซโท',
                'code' => '426'
            ],
            [
                'title' => 'เลบานอน',
                'code' => '422'
            ],
            [
                'title' => 'ไลบีเรีย',
                'code' => '430'
            ],
            [
                'title' => 'วานูวาตู',
                'code' => '548'
            ],
            [
                'title' => 'วาลิสและฟูตูนา',
                'code' => '876'
            ],
            [
                'title' => 'เวเนซุเอลา',
                'code' => '862'
            ],
            [
                'title' => 'เวียดนาม',
                'code' => '704'
            ],
            [
                'title' => 'ศรีลังกา',
                'code' => '144'
            ],
            [
                'title' => 'สเปน',
                'code' => '724'
            ],
            [
                'title' => 'สโลวาเกีย',
                'code' => '703'
            ],
            [
                'title' => 'สโลวีเนีย',
                'code' => '705'
            ],
            [
                'title' => 'สวาซิแลนด์',
                'code' => '748'
            ],
            [
                'title' => 'สวิตเซอร์แลนด์',
                'code' => '756'
            ],
            [
                'title' => 'สวีเดน',
                'code' => '752'
            ],
            [
                'title' => 'สหรัฐ',
                'code' => '840'
            ],
            [
                'title' => 'สหรัฐอาหรับเอมิเรตส์',
                'code' => '784'
            ],
            [
                'title' => 'สหราชอาณาจักร',
                'code' => '826'
            ],
            [
                'title' => 'สาธารณรัฐคองโก',
                'code' => '178'
            ],
            [
                'title' => 'สาธารณรัฐโดมินิกัน',
                'code' => '214'
            ],
            [
                'title' => 'สาธารณรัฐประชาธิปไตยคองโก',
                'code' => '180'
            ],
            [
                'title' => 'สาธารณรัฐแอฟริกากลาง',
                'code' => '140'
            ],
            [
                'title' => 'สิงคโปร์',
                'code' => '702'
            ],
            [
                'title' => 'หมู่เกาะคุก',
                'code' => '184'
            ],
            [
                'title' => 'หมู่เกาะเคย์แมน',
                'code' => '136'
            ],
            [
                'title' => 'หมู่เกาะโคโคส',
                'code' => '166'
            ],
            [
                'title' => 'หมู่เกาะโซโลมอน',
                'code' => '90'
            ],
            [
                'title' => 'หมู่เกาะเติกส์และเคคอส',
                'code' => '796'
            ],
            [
                'title' => 'หมู่เกาะนอร์เทิร์นมาเรียนา',
                'code' => '580'
            ],
            [
                'title' => 'หมู่เกาะบริติชเวอร์จิน',
                'code' => '92'
            ],
            [
                'title' => 'หมู่เกาะพิตแคร์น',
                'code' => '612'
            ],
            [
                'title' => 'หมู่เกาะฟอล์กแลนด์',
                'code' => '238'
            ],
            [
                'title' => 'หมู่เกาะแฟโร',
                'code' => '234'
            ],
            [
                'title' => 'หมู่เกาะมาร์แชลล์',
                'code' => '584'
            ],
            [
                'title' => 'หมู่เกาะเวอร์จินของสหรัฐอเมริกา',
                'code' => '850'
            ],
            [
                'title' => 'หมู่เกาะโอลันด์',
                'code' => '248'
            ],
            [
                'title' => 'อเมริกันซามัว',
                'code' => '16'
            ],
            [
                'title' => 'ออสเตรเลีย',
                'code' => '36'
            ],
            [
                'title' => 'ออสเตรีย',
                'code' => '40'
            ],
            [
                'title' => 'อันดอร์รา',
                'code' => '20',
            ],
            [
                'title' => 'อัฟกานิสถาน',
                'code' => '4'
            ],
            [
                'title' => 'อาเซอร์ไบจาน',
                'code' => '31'
            ],
            [
                'title' => 'อาร์เจนตินา',
                'code' => '32'
            ],
            [
                'title' => 'อาร์มีเนีย',
                'code' => '51'
            ],
            [
                'title' => 'อารูบา',
                'code' => '533'
            ],
            [
                'title' => 'อิเควทอเรียลกินี',
                'code' => '226'
            ],
            [
                'title' => 'อิตาลี',
                'code' => '380'
            ],
            [
                'title' => 'อินเดีย',
                'code' => '356'
            ],
            [
                'title' => 'อินโดนีเซีย',
                'code' => '360'
            ],
            [
                'title' => 'อิรัก',
                'code' => '368'
            ],
            [
                'title' => 'อิสราเอล',
                'code' => '376'
            ],
            [
                'title' => 'อิหร่าน',
                'code' => '364'
            ],
            [
                'title' => 'อียิปต์',
                'code' => '818'
            ],
            [
                'title' => 'อุซเบกิสถาน',
                'code' => '860'
            ],
            [
                'title' => 'อุรุกวัย',
                'code' => '858'
            ],
            [
                'title' => 'เอกวาดอร์',
                'code' => '218'
            ],
            [
                'title' => 'เอธิโอเปีย',
                'code' => '231'
            ],
            [
                'title' => 'เอริเทรีย',
                'code' => '232'
            ],
            [
                'title' => 'เอลซัลวาดอร์',
                'code' => '222'
            ],
            [
                'title' => 'เอสโตเนีย',
                'code' => '233'
            ],
            [
                'title' => 'แองกวิลลา',
                'code' => '660'
            ],
            [
                'title' => 'แองโกลา',
                'code' => '24'
            ],
            [
                'title' => 'แอนตาร์กติกา',
                'code' => '10'
            ],
            [
                'title' => 'แอนติกาและบาร์บูดา',
                'code' => '28'
            ],
            [
                'title' => 'แอฟริกาใต้',
                'code' => '710'
            ],
            [
                'title' => 'แอลจีเรีย',
                'code' => '12'
            ],
            [
                'title' => 'แอลเบเนีย',
                'code' => '8'
            ],
            [
                'title' => 'โอมาน',
                'code' => '512'
            ],
            [
                'title' => 'ไอซ์แลนด์',
                'code' => '352'
            ],
            [
                'title' => 'ไอร์แลนด์',
                'code' => '372'
            ],
            [
                'title' => 'ไอล์ออฟแมน',
                'code' => '833'
            ],
            [
                'title' => 'ฮ่องกง',
                'code' => '344'
            ],
            [
                'title' => 'ฮอนดูรัส',
                'code' => '340'
            ],
            [
                'title' => 'ฮังการี',
                'code' => '348'
            ],
            [
                'title' => 'เฮติ',
                'code' => '332'
            ],
            [
                'title' => 'ซินต์มาร์เติน',
                'code' => '534'
            ],
            [
                'title' => 'เนเธอร์แลนด์แคริบเบียน',
                'code' => '535'
            ],
            [
                'title' => 'สฟาลบาร์และยานไมเอน',
                'code' => '744'
            ]
        ];

        Country::insert($countries);
    }
}
